{
  "introScript": [
    "Click to advance!",
    "One day, while playing in a forest, a young boy slipped and fell into a nearby river.",
    "The boy tried to swim to shore, but his body was swept by the currents. Gasping for air, he feared that these were to be his last moments.",
    "Suddenly, something reached for his arm and pulled him to safety!",
    "After regaining his composure and giving his thanks, the boy got a proper look at his savior.",
    "To his surprise, it appeared to be a mermaid who was around the same age he was!",
    "The little girl introduced herself as ‘Emily’ and explains that she had been watching the boy whenever he ventured into the forest, but never had the courage to approach him.",
    "She further explained that she lost her parents some time ago and that she has been alone ever since. Furthermore, as a mermaid, she would perish if she were to leave any body of water for an extended amount of time.",
    "Moved, the boy introduced himself as ‘Oscar’ and promised to visit Emily whenever he had the time. He also vowed to figure out a way to make her able to live on land.",
    "Nine years have passed since then…",
    "Oscar: It took a while, but I’ve finally finished college and earned a diploma in alchemy!",
    "Oscar: What’s more, now that I’m 21, I can legally own alchemy supplies and practice the art in peace.",
    "Oscar: Enduring my mediocre job as a delivery boy paid off, as I was able to purchase the ingredients needed to develop a potion that turns mermaids into humans.",
    "Oscar: Apparently, crafting transmogrification potions is taboo where I live due to ethical concerns involving unwilling participants. However, people have circumvented this by hiding a full recipe across various items.",
    "Oscar: To be honest, it’s a completely silly and convoluted way of going about things, but it prevents information from falling into the wrong hands, so that’s nice.",
    "Oscar: All I have to do now is remember the exact quantity of the necessary ingredients… but my head’s coming up with a blank.",
    "Oscar: Eh, I’m sure the various items I have around the house can give me the answers I need."
  ],
  "scrollScript": [
    "Oscar: A scroll huh… That reminds me of a conversation I had with Emily."
    "Oscar: Hey Emily!",
    "Emily: Oh, hi Oscar!",
    "Emily: I’ve been reading the books and scrolls you’ve given me about alchemy.",
    "Oscar: How are they?",
    "Emily: Many are surprisingly easy to understand thanks to the many illustrations they provide. I even managed to decode a few words in one of the scrolls!",
    "Emily: Apparently, said scroll contained one of the key ingredients to crafting the elixir!",
    "Oscar: Wow, you’re really into this. I don’t mean to discourage you, but doesn’t turning into another creature terrify you? I mean, I kind of simple-mindedly started this project on a whim as a kid and I don’t want to force you to partake in this if you don’t feel like it.",
    "Emily: I can assure you that I don’t have any qualms about this experiment.",
    "Emily: While I’m used to this lifestyle, I would be lying if it didn’t bring me a lot of loneliness.",
    "Emily: Being bound to this forest with little means of escape is often distressing. I don’t have many people to talk to and I often hide from strangers out of fear that they could hurt me.",
    "Emily: There are days where I just curl up and start overthinking things. Like what could have happened to my parents.",
    "Emily: I woke up one day and they just vanished… Maybe they were killed that night or maybe they found a way to turn human and took that opportunity as soon as they could… I have no way of knowing what truly happened.",
    "Oscar: I’m really sorry for bringing up painful memories...",
    "Emily: Oh, don’t feel bad! I guess I couldn’t contain myself and went on a little tangent. I just feel comfortable sharing things like this with you.",
    "Emily: As a matter of fact, you’re the only person I converse with on a regular basis! Kind of weird isn’t it?",
    "Oscar: I guess, but I don’t talk to a lot of people though, so I usually enjoy the time I spend with you.",
    "Oscar: And don’t hesitate to share your problems with me, that’s what friends are for.",
    "Emily: … Thank you, please don’t hesitate to do the same.",
    "Oscar: By the way, what was that ingredient you mentioned?",
    "Emily: Ah! I almost forgot! It was a few pairs of fish eyes.",
    "Oscar: Alright, got it (that seems obvious).",
    "Oscar: … I didn’t expect that conversation to take a serious turn.",
    "Oscar: Looking back, I forgot to ask her the quantity needed. Oh well, I’m sure it’s written on the scroll."
  ],
  "wheelScript": [
    "Oscar: The strange wheel…",
    "Oscar: Apparently, one of the ingredients for the elixir is on this thing. Now, what was it…",
    "Oscar: … hmm.",
    "Emily: Say Oscar, what are you doing with that wheel?",
    "Oscar: One of the ingredients for the elixir is on it, but I’m having trouble figuring it out.",
    "Emily: Let me have a look… Ah! I’ve heard about this one!",
    "Emily: I think all you have to do is combine words with the same color to learn about the ingredient. After that, you count the number of letters in that ingredient and you have the exact quantity!",
    "Oscar: Wow, and I was totally stumped about this whole thing.",
    "Emily: I’m sure a five-year-old could figure out the color part.",
    "Oscar: Hey! In my defense, something like that seems way too simple for it to be the answer!",
    "Emily: But, doesn’t it have to be simple so that people easily figure out the code?",
    "Oscar: …",
    "Emily: Don’t look so down, Oscar! I’m sure you’re a brilliant person in your own way.",
    "Oscar: Thanks, but to tell you the truth, I’m not anything special.",
    "Oscar: I’m as average as they come. I’m not popular and I mostly keep to myself a lot. I spend most of my day lazing around at home without a care in the world, creating lackluster potions because I have trouble reading complicated alchemy books.",
    "Oscar: Funny thing is, my parents are opposed to me studying alchemy, due to there being a lack of profitable jobs in that field. I remember having a giant argument with them which resulted in me moving out.",
    "Oscar: Looking back, it was a pretty stupid thing to do.",
    "Emily: Oscar, you should have more confidence in yourself.",
    "Emily: You found something that you’re passionate about and you’ve stuck with it despite opposition. There must have been many times where you thought of giving up but you pulled through to it all.",
    "Emily: I’m sure many people would love to have your kind of dedication.",
    "Oscar: Thanks Emily, that means a lot to me.",
    "Emily: Although you should probably patch things up with your folks.",
    "Oscar: Y-yeah…",
    "Oscar: So, what’s the ingredient anyway?",
    "Emily: I’m sure you can figure it out by now. There is a running theme to these ingredients after all.",
    "Oscar: Not the answer I was expecting, but I’m sure that I can do this!",
    "Emily: That’s the spirit, Oscar!",
    "Oscar: I still can’t believe the wheel was that simple to figure out.",
    "Oscar: Maybe I should write a letter to Mom and Dad someday…"
  ],
  "paperScript": [
    "Oscar: Ah, this thing.",
    "Oscar: The ‘Magic Paper’.",
    "Oscar: What’s that Emily?",
    "Emily: Huh!? Oh, this is ‘Magic Paper’!",
    "Oscar: … What?",
    "Emily: You write a password and the appropriate message will appear!",
    "Emily: For example, by writing ‘corn’ onto the paper, a recipe for baking a cake appears!",
    "Oscar: That’s quite a handy way of hiding information, where did you get it?",
    "Emily: I bought it off of a merchant with the money you gave me.",
    "Oscar: Wait, you actually talked to someone!? Also, when did I give you money?",
    "Emily: Hey! Don’t sell me short like that! Of course I have to speak when necessary. You were really excited when you graduated and gave me cash in case a merchant were to wander these woods.",
    "Emily: Seeing your enthusiasm for wanting this elixir project to succeed made me want to better my situation too! So I’ve been haggling with dealers for a while now.",
    "Oscar: I must have forgotten all this during the excitement. I’m sorry I misjudged you. It’s just that ever since we were kids, you always found it difficult to talk to others. For the most part, you just observed things from a distance.",
    "Oscar: Heck, on the day we introduced ourselves, you said that you were watching me for some time. Guess that makes you my stalker!",
    "Emily: Oscar!",
    "Oscar: Kidding, kidding!",
    "Oscar: By the way, that paper has an ingredient for the potion, doesn’t it?",
    "Emily: Yes, it does and the password for it is ‘anemone’.",
    "Oscar: Sweet, can I take the paper with me?",
    "Emily: Sure, but I just need a little more time with it.",
    "Oscar: Huh?",
    "Emily: I just want to write down that cake recipe.",
    "Emily: There are a lot of things I want to do if I ever turn human and learning how to bake is one of those things. That way I can make as many sweets as I want!",
    "Emily: … And I’d also like to bake a nice cake to show my appreciation for you.",
    "Oscar: O-Oh, I’d be flattered, but you don’t have to go through such lengths for me…",
    "Emily: But I’ve already gotten an ingredient for the elixir, didn’t I?",
    "Oscar: Ah, right…",
    "Oscar: Man, I’m not sure how to respond to that whole cake business. I don’t think I have the courage to ask her directly if she likes me or not…"
  ],
  "normalEndingScript": [
    "Oscar: Alright, the potion’s ready. I hope this works.",
    "Oscar: Emily!",
    "Emily: Oscar, why all the running?!",
    "Oscar: I’ve finished the elixir! With this, you should be able to turn human.",
    "Emily: It’s finally done?! Thank you, Oscar!",
    "Emily: Say, if I try this, will there be any side effects?",
    "Oscar: You’ll be fine. There have been no reports of long-term negative side effects when transmuting. It might take a while to get used to your new body though.",
    "Emily: In that case, I’m ready, here we go!",
    "*Gulp*",
    "Emily: …",
    "Oscar: …",
    "Emily: …",
    "Oscar: …",
    "Oscar: It doesn’t seem like anything’s happening. Guess I screwed something up, I’m sorry for getting your hopes up, Emily.",
    "Emily: Don’t blame yourself, you’re doing all this just for me. If anything, I should be the one to blame, because you go through so much for me and I just take the time out of your busy schedule.",
    "Oscar: Nonsense, you saved my life all those years ago and the least I can do to repay you is by giving you a chance at a new life.",
    "Oscar: Truth be told, it’s because of you that I wanted to pursue alchemy. I don’t know where I’d be if I hadn’t met you.",
    "Oscar: (Maybe six feet under… But, it’s best not to think about that)",
    "Emily: Oscar, thank you. I really mean it when I say that I treasure the time we spend together.",
    "Emily: Hee hee, look at us being all sentimental…",
    "Oscar: Yeah, but now I’m motivated to gather up some ingredients and try this again! Just you wait Emily, I will succeed in turning you human!",
    "Emily: I look forward to it. Good luck Oscar and don’t hesitate to ask for help!",
    "NORMAL END: Re-attempt"
  ],
  "goodEndingScript": [
    "Oscar: Alright, the potion’s ready, I have a good feeling about this!",
    "Oscar: Emily!",
    "Emily: Oscar, why all the running?!",
    "Oscar: I’ve finished the elixir! With this, you should be able to turn human.",
    "Emily: It’s finally done?! Thank you, Oscar!",
    "Emily: Say, if I try this, will there be any side effects?",
    "Oscar: You’ll be fine. There have been no reports of long-term negative side effects when transmuting. It might take a while to get used to your new body though.",
    "Emily: In that case, I’m ready, here we go!",
    "*Gulp*",
    "Emily: …",
    "Oscar: …",
    "* POOF! *",
    "Oscar: It-it worked! It actually worked! Emily, how are you feeling!?",
    "Emily: Everything is a little disorienting, but maybe it’s because I’m elated!",
    "Oscar: Okay, let’s both calm down and access the situation. Can you stand? I’ll help you up.",
    "Emily: Thank you…",
    "Oscar: Wow, you’re a lot taller than I expected…",
    "Emily: Does my height make me look weird?",
    "Oscar: Huh?! No, not at all, it was just an observation! I’m always used to looking down when talking to you, so this might take a while to get used to.",
    "Oscar: W-woah, hey! What’s with the sudden hug?",
    "Emily: Well, it’s a little hard to walk and I also wanted to show my appreciation. Oh Oscar, I can’t thank you enough…",
    "Oscar: Well, you saved my life when I was twelve, so really this is the least I could do, sorry it took so long.",
    "Emily: It’s alright, as long as you’re by my side, I can endure anything. Thanks to you, I am no longer bound by this forest and can take my first steps towards establishing a new life!",
    "Emily: Wait a minute, I’m going to need a new house and a job to stay afloat!",
    "Oscar: You can stay at my place for the time being. As for a job, I can pull a few strings in order to get you something.",
    "Emily: Thanks again, Oscar!",
    "Oscar: Anytime, Emily. I’ll always be by your side.",
    "GOOD END: A New Start"
  ]

}
